Revit 2027 API
BuiltInFailures.StairRampFailures.AutomaticLandingConvertedToSketchedLandingWarning Property
 Some run(s) are deleted, so automatic landing is converted to sketched landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AutomaticLandingConvertedToSketchedLandingWarning { get; }
Public Shared ReadOnly Property AutomaticLandingConvertedToSketchedLandingWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AutomaticLandingConvertedToSketchedLandingWarning {
	FailureDefinitionId^ get ();
}
static member AutomaticLandingConvertedToSketchedLandingWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace